<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Document</title>
    <link rel="stylesheet" href="/style.css">
</head>
<body>
    <header>
        <h1>Encabezado principal</h1>
        <nav>
            <ul>
                <li>Link 1</li>
                <li>Link 2</li>
                <li>Link 3</li>
                <li>Link 4</li>
            </ul>
        </nav>
    </header>

    <main>
        <article>
                <h3>Espaciado entre palabras (propiedad word-spacing)</h3>

                <p>La propiedad word-spacing se utiliza para especificar el espacio entre las palabras de un texto. Puede recibir el valor normal (por defecto), una unidad de longitud o inherit.</p>
            

                <h3>Ejemplos de espaciado entre palabras:</h3>

                <p>Este es un p&aacute;rrafo con espaciado entre palabras normal.</p>
                <p>Este es un p&aacute;rrafo con espaciado entre palabras más grande.</p>
                <p>Este es un p&aacute;rrafo con espaciado entre palabras más pequeño.</p>
        </article>


        <article>
                <h3>Espaciado entre letras (propiedad letter-spacing)</h3>

                <p>La propiedad letter-spacing se utiliza para especificar el espacio entre los caracteres de un texto. Puede recibir el valor normal (por defecto), una unidad de longitud o inherit.</p>

                
                <h3>EJemplos de espaciado entre letras</h3>

                <p>Este es un p&aacute;rrafo con espaciado entre letras normal.</p>
                <p>Este es un p&aacute;rrafo con espaciado entre letras más grande.</p>
                <p>Este es un p&aacute;rrafo con espaciado entre letras más pequeño.</p>
        </article>


        <article>
                <h3>L&iacute;nea de decoración</h3>

                <p>La propiedad text-decoration se usa para agregar una l&iacute;nea de decoración al texto. En la propiedad text-decoration, se puede indicar el tipo, color, estilo y ancho de la l&iacute;nea con una sola propiedad.</p>


                <h3>Ejemplos de text-decoration</h3>

                <p>Soy el p&aacute;rrafo 1 y muestro mi texto subrayado.</p>
                <p>Soy el p&aacute;rrafo 2 y muestro una l&iacute;nea encima del texto de color rojo</p>
                <p>Soy el p&aacute;rrafo 3 y muestro mi texto con una l&iacute;nea atravesada, de color azul y de estilo doble.</p>
                <p>Soy el p&aacute;rrafo 4 y muestro una l&iacute;nea por encima y por debajo de mi texto de color morada, de estilo punteado y de ancho auto.</p>
                <p>Soy el p&aacute;rrafo 5 y muestro una l&iacute;nea por debajo de color amarillo, con guiones y de 0.25em de ancho.</p>
                <p>Soy el p&aacute;rrafo 6 y muestro mi texto con una l&iacute; atravesada, de color rosa, de estilo curvo y de 1% de ancho.</p>
        </article>


        <article>
            <h3>Transformación de texto (propiedad text-transform)</h3>

            <p>La propiedad text-transform se utiliza para especificar letras may&uacute;sculas y min&uacute;sculas en un texto. Se puede usar para convertir todo en letras may&uacute;sculas o min&uacute;sculas, o poner en may&uacute;scula la primera letra de cada palabra.</p>


            <h3>Ejemplos de transformaci&oacute;n de texto:</h3>

            <p>Este es un p&aacute;rrafo sin transformaci&oacute;n de texto.</p>
            <p>Este texto estaba en min&uacute;sculas y se trasnform&oacute; en may&uacute;sculas con CSS.</p>
            <p>ESTE TEXTO ESTABA EN MAY&Uacute;SCULAS Y SE TRASNFORM&Oacute; A MIN&Uacute;SCULAS.</p>
            <P>Este texto comienza con may&uacute;scula al principio de cada palabra.</P>
        </article>

        <article>
            <p>¡Ya casi acabo!</p>
        </article>
    </main>

    <footer>
        <h3>Pie de p&aacute;gina</h3>
        &copy; Derechos reservados 2023.
    </footer>
</body>
</html>